## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_management_group.l2mgs["l2mg1"] will be created
  + resource "azurerm_management_group" "l2mgs" {
      + display_name               = "l2mg1"
      + id                         = (known after apply)
      + name                       = "l2mg1"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.l2mgs["l2mg2"] will be created
  + resource "azurerm_management_group" "l2mgs" {
      + display_name               = "l2mg2"
      + id                         = (known after apply)
      + name                       = "l2mg2"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.top_mg will be created
  + resource "azurerm_management_group" "top_mg" {
      + display_name               = "l1mg1"
      + id                         = (known after apply)
      + name                       = "l1mg1"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>